<?php

declare(strict_types=1);

namespace Parsify;

/**
 * Class CharacterMapping
 *
 * Provides character mappings for converting Arabic script to Persian and handling special characters.
 */
class CharacterMapping
{
    /**
     * Constant array mapping Arabic letters to Persian equivalents.
     */
    private const ARABIC_TO_PERSIAN_LETTERS = [
        'ي' => 'ی', 'ك' => 'ک', 'دِ' => 'د', 'بِ' => 'ب', 'زِ' => 'ز', 'ذِ' => 'ذ',
        'شِ' => 'ش', 'سِ' => 'س', 'ى' => 'ی', 'ة' => 'ه',
    ];

    private const DIACRITICS = [
        '؆' => '', '؇' => '', '؈' => '', '؉' => '', '؊' => '', '؍' => '', '؎' => '',
        'ؐ' => '', 'ؑ' => '', 'ؒ' => '', 'ؓ' => '', 'ؔ' => '', 'ؕ' => '', 'ؖ' => '',
        'ؘ' => '', 'ؙ' => '', 'ؚ' => '', '؞' => '', 'ٖ' => '', 'ٗ' => '', '٘' => '',
        'ٙ' => '', 'ٚ' => '', 'ٛ' => '', 'ٜ' => '', 'ٝ' => '', 'ٞ' => '', 'ٟ' => '',
        '٪' => '', '٬' => '', '٭' => '', 'ہ' => '', 'ۂ' => '', 'ۃ' => '', '۔' => '',
        'ۖ' => '', 'ۗ' => '', 'ۘ' => '', 'ۙ' => '', 'ۚ' => '', 'ۛ' => '', 'ۜ' => '',
        '۞' => '', '۟' => '', '۠' => '', 'ۡ' => '', 'ۢ' => '', 'ۣ' => '', 'ۤ' => '',
        'ۥ' => '', 'ۦ' => '', 'ۧ' => '', 'ۨ' => '', '۩' => '', '۪' => '', '۫' => '',
        '۬' => '', 'ۭ' => '', 'ۮ' => '', 'ۯ' => '', 'ﮧ' => '', '﮲' => '', '﮳' => '',
        '﮴' => '', '﮵' => '', '﮶' => '', '﮷' => '', '﮸' => '', '﮹' => '', '﮺' => '',
        '﮻' => '', '﮼' => '', '﮽' => '', '﮾' => '', '﮿' => '', '﯀' => '', '﯁' => '',
        'ﱞ' => '', 'ﱟ' => '', 'ﱠ' => '', 'ﱡ' => '', 'ﱢ' => '', 'ﱣ' => '', 'ﹰ' => '',
        'ﹱ' => '', 'ﹲ' => '', 'ﹳ' => '', 'ﹴ' => '', 'ﹶ' => '', 'ﹷ' => '', 'ﹸ' => '',
        'ﹹ' => '', 'ﹺ' => '', 'ﹻ' => '', 'ﹼ' => '', 'ﹽ' => '', 'ﹾ' => '', 'ﹿ' => ''
    ];

    private const PERSIAN_DIACRITICS = [
        'ٌ' => '', 'َ' => '', 'ُ' => '', 'ِ' => '', 'ّ' => '', 'ً' => '', 'ٍ' => '',
        'ْ' => '', 'ٰ' => '', 'ٔ' => '', 'ٕ' => '', 'ٓ' => ''
    ];

    private const SPECIAL_CHARACTERS = [
        'أ' => 'ا', 'إ' => 'ا', 'ٱ' => 'ا', 'ٲ' => 'ا', 'ٳ' => 'ا', 'ٵ' => 'ا',
        'ݳ' => 'ا', 'ݴ' => 'ا', 'ﭐ' => 'ا', 'ﭑ' => 'ا', 'ﺃ' => 'ا', 'ﺄ' => 'ا',
        'ﺇ' => 'ا', 'ﺈ' => 'ا', 'ﺍ' => 'ا', 'ﺎ' => 'ا', '𞺀' => 'ا', 'ﴼ' => 'ا',
        'ﴽ' => 'ا', '𞸀' => 'ا',
        'ٮ' => 'ب', 'ݕ' => 'ب', 'ݖ' => 'ب', 'ﭒ' => 'ب', 'ﭓ' => 'ب', 'ﭔ' => 'ب',
        'ﭕ' => 'ب', 'ﺏ' => 'ب', 'ﺐ' => 'ب', 'ﺑ' => 'ب', 'ﺒ' => 'ب', '𞸁' => 'ب',
        '𞸜' => 'ب', '𞸡' => 'ب', '𞹡' => 'ب', '𞹼' => 'ب', '𞺁' => 'ب', '𞺡' => 'ب',
        'ڀ' => 'پ', 'ݐ' => 'پ', 'ݔ' => 'پ', 'ﭖ' => 'پ', 'ﭗ' => 'پ', 'ﭘ' => 'پ',
        'ﭙ' => 'پ', 'ﭚ' => 'پ', 'ﭛ' => 'پ', 'ﭜ' => 'پ', 'ﭝ' => 'پ',
        'ٹ' => 'ت', 'ٺ' => 'ت', 'ٻ' => 'ت', 'ټ' => 'ت', 'ݓ' => 'ت', 'ﭞ' => 'ت',
        'ﭟ' => 'ت', 'ﭠ' => 'ت', 'ﭡ' => 'ت', 'ﭢ' => 'ت', 'ﭣ' => 'ت', 'ﭤ' => 'ت',
        'ﭥ' => 'ت', 'ﭦ' => 'ت', 'ﭧ' => 'ت', 'ﭨ' => 'ت', 'ﭩ' => 'ت', 'ﺕ' => 'ت',
        'ﺖ' => 'ت', 'ﺗ' => 'ت', 'ﺘ' => 'ت', '𞸕' => 'ت', '𞸵' => 'ت', '𞹵' => 'ت',
        '𞺕' => 'ت', '𞺵' => 'ت',
        'ٽ' => 'ث', 'ٿ' => 'ث', 'ݑ' => 'ث', 'ﺙ' => 'ث', 'ﺚ' => 'ث', 'ﺛ' => 'ث',
        'ﺜ' => 'ث', '𞸖' => 'ث', '𞸶' => 'ث', '𞹶' => 'ث', '𞺖' => 'ث', '𞺶' => 'ث',
        'ڃ' => 'ج', 'ڄ' => 'ج', 'ﭲ' => 'ج', 'ﭳ' => 'ج', 'ﭴ' => 'ج', 'ﭵ' => 'ج',
        'ﭶ' => 'ج', 'ﭷ' => 'ج', 'ﭸ' => 'ج', 'ﭹ' => 'ج', 'ﺝ' => 'ج', 'ﺞ' => 'ج',
        'ﺟ' => 'ج', 'ﺠ' => 'ج', '𞸂' => 'ج', '𞸢' => 'ج', '𞹂' => 'ج', '𞹢' => 'ج',
        '𞺂' => 'ج', '𞺢' => 'ج',
        'ڇ' => 'چ', 'ڿ' => 'چ', 'ݘ' => 'چ', 'ﭺ' => 'چ', 'ﭻ' => 'چ', 'ﭼ' => 'چ',
        'ﭽ' => 'چ', 'ﭾ' => 'چ', 'ﭿ' => 'چ', 'ﮀ' => 'چ', 'ﮁ' => 'چ', '𞸃' => 'چ',
        '𞺃' => 'چ',
        'ځ' => 'ح', 'ݮ' => 'ح', 'ݯ' => 'ح', 'ݲ' => 'ح', 'ݼ' => 'ح', 'ﺡ' => 'ح',
        'ﺢ' => 'ح', 'ﺣ' => 'ح', 'ﺤ' => 'ح', '𞸇' => 'ح', '𞸧' => 'ح', '𞹇' => 'ح',
        '𞹧' => 'ح', '𞺇' => 'ح', '𞺧' => 'ح',
        'ڂ' => 'خ', 'څ' => 'خ', 'ݗ' => 'خ', 'ﺥ' => 'خ', 'ﺦ' => 'خ', 'ﺧ' => 'خ',
        'ﺨ' => 'خ', '𞸗' => 'خ', '𞸷' => 'خ', '𞹗' => 'خ', '𞹷' => 'خ', '𞺗' => 'خ',
        '𞺷' => 'خ',
        'ڈ' => 'د', 'ډ' => 'د', 'ڊ' => 'د', 'ڌ' => 'د', 'ڍ' => 'د', 'ڎ' => 'د',
        'ڏ' => 'د', 'ڐ' => 'د', 'ݙ' => 'د', 'ݚ' => 'د', 'ﺩ' => 'د', 'ﺪ' => 'د',
        '𞺣' => 'د', 'ﮂ' => 'د', 'ﮃ' => 'د', 'ﮈ' => 'د', 'ﮉ' => 'د',
        'ﱛ' => 'ذ', 'ﱝ' => 'ذ', 'ﺫ' => 'ذ', 'ﺬ' => 'ذ', '𞸘' => 'ذ', '𞺘' => 'ذ',
        '𞺸' => 'ذ', 'ﮄ' => 'ذ', 'ﮅ' => 'ذ', 'ﮆ' => 'ذ', 'ﮇ' => 'ذ',
        '٫' => 'ر', 'ڑ' => 'ر', 'ڒ' => 'ر', 'ړ' => 'ر', 'ڔ' => 'ر', 'ڕ' => 'ر',
        'ږ' => 'ر', 'ݛ' => 'ر', 'ݬ' => 'ر', 'ﮌ' => 'ر', 'ﮍ' => 'ر', 'ﱜ' => 'ر',
        'ﺭ' => 'ر', 'ﺮ' => 'ر', '𞸓' => 'ر', '𞺓' => 'ر', '𞺳' => 'ر',
        'ڗ' => 'ز', 'ڙ' => 'ز', 'ݫ' => 'ز', 'ݱ' => 'ز', 'ﺯ' => 'ز', 'ﺰ' => 'ز',
        '𞸆' => 'ز', '𞺆' => 'ز', '𞺦' => 'ز',
        'ﮊ' => 'ژ', 'ﮋ' => 'ژ', 'ژ' => 'ژ',
        'ښ' => 'س', 'ݽ' => 'س', 'ݾ' => 'س', 'ﺱ' => 'س', 'ﺲ' => 'س', 'ﺳ' => 'س',
        'ﺴ' => 'س', '𞸎' => 'س', '𞸮' => 'س', '𞹎' => 'س', '𞹮' => 'س', '𞺎' => 'س',
        '𞺮' => 'س',
        'ڛ' => 'ش', 'ۺ' => 'ش', 'ݜ' => 'ش', 'ݭ' => 'ش', 'ݰ' => 'ش', 'ﺵ' => 'ش',
        'ﺶ' => 'ش', 'ﺷ' => 'ش', 'ﺸ' => 'ش', '𞸔' => 'ش', '𞸴' => 'ش', '𞹔' => 'ش',
        '𞹴' => 'ش', '𞺔' => 'ش', '𞺴' => 'ش', 'ڜ' => 'ش',
        'ڝ' => 'ص', 'ﺹ' => 'ص', 'ﺺ' => 'ص', 'ﺻ' => 'ص', 'ﺼ' => 'ص', '𞸑' => 'ص',
        '𞹑' => 'ص', '𞸱' => 'ص', '𞹱' => 'ص', '𞺑' => 'ص', '𞺱' => 'ص',
        'ڞ' => 'ض', 'ۻ' => 'ض', 'ﺽ' => 'ض', 'ﺾ' => 'ض', 'ﺿ' => 'ض', 'ﻀ' => 'ض',
        '𞸙' => 'ض', '𞸹' => 'ض', '𞹙' => 'ض', '𞹹' => 'ض', '𞺙' => 'ض', '𞺹' => 'ض',
        'ﻁ' => 'ط', 'ﻂ' => 'ط', 'ﻃ' => 'ط', 'ﻄ' => 'ط', '𞸈' => 'ط', '𞹨' => 'ط',
        '𞺈' => 'ط', '𞺨' => 'ط',
        'ڟ' => 'ظ', 'ﻅ' => 'ظ', 'ﻆ' => 'ظ', 'ﻇ' => 'ظ', 'ﻈ' => 'ظ', '𞸚' => 'ظ',
        '𞹺' => 'ظ', '𞺚' => 'ظ', '𞺺' => 'ظ',
        '؏' => 'ع', 'ڠ' => 'ع', 'ﻉ' => 'ع', 'ﻊ' => 'ع', 'ﻋ' => 'ع', 'ﻌ' => 'ع',
        '𞸏' => 'ع', '𞸯' => 'ع', '𞹏' => 'ع', '𞹯' => 'ع', '𞺏' => 'ع', '𞺯' => 'ع',
        'ۼ' => 'غ', 'ݝ' => 'غ', 'ݞ' => 'غ', 'ݟ' => 'غ', 'ﻍ' => 'غ', 'ﻎ' => 'غ',
        'ﻏ' => 'غ', 'ﻐ' => 'غ', '𞸛' => 'غ', '𞸻' => 'غ', '𞹛' => 'غ', '𞹻' => 'غ',
        '𞺛' => 'غ', '𞺻' => 'غ',
        '؋' => 'ف', 'ڡ' => 'ف', 'ڢ' => 'ف', 'ڣ' => 'ف', 'ڤ' => 'ف', 'ڥ' => 'ف',
        'ڦ' => 'ف', 'ݠ' => 'ف', 'ݡ' => 'ف', 'ﭪ' => 'ف', 'ﭫ' => 'ف', 'ﭬ' => 'ف',
        'ﭭ' => 'ف', 'ﭮ' => 'ف', 'ﭯ' => 'ف', 'ﭰ' => 'ف', 'ﭱ' => 'ف', 'ﻑ' => 'ف',
        'ﻒ' => 'ف', 'ﻓ' => 'ف', 'ﻔ' => 'ف', '𞸐' => 'ف', '𞸞' => 'ف', '𞸰' => 'ف',
        '𞹰' => 'ف', '𞹾' => 'ف', '𞺐' => 'ف', '𞺰' => 'ف',
        'ٯ' => 'ق', 'ڧ' => 'ق', 'ڨ' => 'ق', 'ﻕ' => 'ق', 'ﻖ' => 'ق', 'ﻗ' => 'ق',
        'ﻘ' => 'ق', '𞸒' => 'ق', '𞸟' => 'ق', '𞸲' => 'ق', '𞹒' => 'ق', '𞹟' => 'ق',
        '𞹲' => 'ق', '𞺒' => 'ق', '𞺲' => 'ق',
        'ػ' => 'ک', 'ؼ' => 'ک', 'ڪ' => 'ک', 'ګ' => 'ک', 'ڬ' => 'ک', 'ڭ' => 'ک',
        'ڮ' => 'ک', 'ݢ' => 'ک', 'ݣ' => 'ک', 'ݤ' => 'ک', 'ݿ' => 'ک', 'ﮎ' => 'ک',
        'ﮏ' => 'ک', 'ﮐ' => 'ک', 'ﮑ' => 'ک', 'ﯓ' => 'ک', 'ﯔ' => 'ک', 'ﯕ' => 'ک',
        'ﯖ' => 'ک', 'ﻙ' => 'ک', 'ﻚ' => 'ک', 'ﻛ' => 'ک', 'ﻜ' => 'ک', '𞸊' => 'ک',
        '𞸪' => 'ک', '𞹪' => 'ک',
        'ڰ' => 'گ', 'ڱ' => 'گ', 'ڲ' => 'گ', 'ڳ' => 'گ', 'ڴ' => 'گ', 'ﮒ' => 'گ',
        'ﮓ' => 'گ', 'ﮔ' => 'گ', 'ﮕ' => 'گ', 'ﮖ' => 'گ', 'ﮗ' => 'گ', 'ﮘ' => 'گ',
        'ﮙ' => 'گ', 'ﮚ' => 'گ', 'ﮛ' => 'گ', 'ﮜ' => 'گ', 'ﮝ' => 'گ',
        'ڵ' => 'ل', 'ڶ' => 'ل', 'ڷ' => 'ل', 'ڸ' => 'ل', 'ݪ' => 'ل', 'ﻝ' => 'ل',
        'ﻞ' => 'ل', 'ﻟ' => 'ل', 'ﻠ' => 'ل', '𞸋' => 'ل', '𞸫' => 'ل', '𞹋' => 'ل',
        '𞺋' => 'ل', '𞺫' => 'ل',
        '۾' => 'م', 'ݥ' => 'م', 'ݦ' => 'م', 'ﻡ' => 'م', 'ﻢ' => 'م', 'ﻣ' => 'م',
        'ﻤ' => 'م', '𞸌' => 'م', '𞸬' => 'م', '𞹬' => 'م', '𞺌' => 'م', '𞺬' => 'م',
        'ڹ' => 'ن', 'ں' => 'ن', 'ڻ' => 'ن', 'ڼ' => 'ن', 'ڽ' => 'ن', 'ݧ' => 'ن',
        'ݨ' => 'ن', 'ݩ' => 'ن', 'ﮞ' => 'ن', 'ﮟ' => 'ن', 'ﮠ' => 'ن', 'ﮡ' => 'ن',
        'ﻥ' => 'ن', 'ﻦ' => 'ن', 'ﻧ' => 'ن', 'ﻨ' => 'ن', '𞸍' => 'ن', '𞸝' => 'ن',
        '𞸭' => 'ن', '𞹍' => 'ن', '𞹝' => 'ن', '𞹭' => 'ن', '𞺍' => 'ن', '𞺭' => 'ن',
        'ؤ' => 'و', 'ٶ' => 'و', 'ٷ' => 'و', 'ۄ' => 'و', 'ۅ' => 'و', 'ۆ' => 'و',
        'ۇ' => 'و', 'ۈ' => 'و', 'ۉ' => 'و', 'ۊ' => 'و', 'ۋ' => 'و', 'ۏ' => 'و',
        'ݸ' => 'و', 'ݹ' => 'و', 'ﯗ' => 'و', 'ﯘ' => 'و', 'ﯙ' => 'و', 'ﯚ' => 'و',
        'ﯛ' => 'و', 'ﯜ' => 'و', 'ﯝ' => 'و', 'ﯞ' => 'و', 'ﯟ' => 'و', 'ﯠ' => 'و',
        'ﯡ' => 'و', 'ﯢ' => 'و', 'ﯣ' => 'و', 'ﺅ' => 'و', 'ﺆ' => 'و', 'ﻭ' => 'و',
        'ﻮ' => 'و', '𞸅' => 'و', '𞺅' => 'و', '𞺥' => 'و',
        'ھ' => 'ه', 'ۀ' => 'ه', 'ە' => 'ه', 'ۿ' => 'ه', 'ﮤ' => 'ه', 'ﮥ' => 'ه',
        'ﮦ' => 'ه', 'ﮩ' => 'ه', 'ﮨ' => 'ه', 'ﮪ' => 'ه', 'ﮫ' => 'ه', 'ﮬ' => 'ه',
        'ﮭ' => 'ه', 'ﺓ' => 'ه', 'ﺔ' => 'ه', 'ﻩ' => 'ه', 'ﻪ' => 'ه', 'ﻫ' => 'ه',
        'ﻬ' => 'ه', '𞸤' => 'ه', '𞹤' => 'ه', '𞺄' => 'ه',
        'ؠ' => 'ی', 'ئ' => 'ی', 'ؽ' => 'ی', 'ؾ' => 'ی', 'ؿ' => 'ی', 'ٸ' => 'ی',
        'ۍ' => 'ی', 'ێ' => 'ی', 'ې' => 'ی', 'ۑ' => 'ی', 'ے' => 'ی', 'ۓ' => 'ی',
        'ݵ' => 'ی', 'ݶ' => 'ی', 'ݷ' => 'ی', 'ݺ' => 'ی', 'ݻ' => 'ی', 'ﮢ' => 'ی',
        'ﮣ' => 'ی', 'ﮮ' => 'ی', 'ﮯ' => 'ی', 'ﮰ' => 'ی', 'ﮱ' => 'ی', 'ﯤ' => 'ی',
        'ﯥ' => 'ی', 'ﯦ' => 'ی', 'ﯧ' => 'ی', 'ﯨ' => 'ی', 'ﯩ' => 'ی', 'ﯼ' => 'ی',
        'ﯽ' => 'ی', 'ﯾ' => 'ی', 'ﯿ' => 'ی', 'ﺉ' => 'ی', 'ﺊ' => 'ی', 'ﺋ' => 'ی',
        'ﺌ' => 'ی', 'ﻯ' => 'ی', 'ﻰ' => 'ی', 'ﻱ' => 'ی', 'ﻲ' => 'ی', 'ﻳ' => 'ی',
        'ﻴ' => 'ی', '𞸉' => 'ی', '𞸩' => 'ی', '𞹉' => 'ی', '𞹩' => 'ی', '𞺉' => 'ی',
        '𞺩' => 'ی',
        'ٴ' => 'ء', '۽' => 'ء', 'ﺀ' => 'ء',
    ];

    private const LIGATURES = [
        'ﻵ' => 'لا', 'ﻶ' => 'لا', 'ﻷ' => 'لا', 'ﻸ' => 'لا', 'ﻹ' => 'لا', 'ﻺ' => 'لا',
        'ﻻ' => 'لا', 'ﻼ' => 'لا',
        'ﷲ' => 'الله', '﷼' => 'ریال', 'ﷳ' => 'اکبر', 'ﷴ' => 'محمد',
        'ﷵ' => 'صلعم', 'ﷶ' => 'رسول', 'ﷷ' => 'علیه السلام', 'ﷸ' => 'وسلم',
        'ﷹ' => 'صلی', 'ﷺ' => 'صلی الله علیه وسلم', 'ﷻ' => 'جل جلاله'
    ];

    /**
     * Returns the complete mapping array combining various character mappings.
     *
     * @param bool $includePersianDiacritic
     * @param bool $includeOtherDiacritic
     * @param bool $includeLigatures
     * @param bool $includeSpecialCharacters
     * @param bool $includeArabicLetters
     *
     * @return array
     */
    public static function getMapping(
        bool $includePersianDiacritic = false,
        bool $includeOtherDiacritic = true,
        bool $includeLigatures = true,
        bool $includeSpecialCharacters = true,
        bool $includeArabicLetters = true,
    ): array {
        return array_merge(
            $includeArabicLetters ? self::ARABIC_TO_PERSIAN_LETTERS : [],
            $includeOtherDiacritic ? self::DIACRITICS : [],
            $includeSpecialCharacters ? self::SPECIAL_CHARACTERS : [],
            $includeLigatures ? self::LIGATURES : [],
            $includePersianDiacritic ? self::PERSIAN_DIACRITICS : []
        );
    }
}
